package com.yurikh.kazlam.debug;

import androidx.room.Dao;
import androidx.room.Ignore;
import androidx.room.Query;
import androidx.room.RawQuery;
import androidx.sqlite.db.SimpleSQLiteQuery;
import androidx.sqlite.db.SupportSQLiteQuery;

import com.yurikh.kazlam.KazlamApp;
import com.yurikh.kazlam.KazlamDb;
import com.yurikh.kazlam.model.Unit;

import java.util.ArrayList;
import java.util.List;
import java.util.stream.Collectors;

import io.reactivex.rxjava3.core.Completable;

@Dao
public abstract class DebugDao {
//   @RawQuery
//   public abstract Completable query(SupportSQLiteQuery query);

   @Query("UPDATE Units SET commanderId=null")
   public abstract void unsetCommanders();

   @Query("DELETE FROM Soldiers")
   public abstract void deleteSoldiers();

   @Query("DELETE FROM Disciplinary")
   public abstract void deleteDisciplinaryNotices();

   @Query("DELETE FROM LeaveRequests")
   public abstract void deleteLeaveRequests();

   @Query("DELETE FROM UnitLogSoldiers")
   protected abstract void deleteUnitLogSoldiers();

   @Query("DELETE FROM UnitLogs")
   protected abstract void deleteUnitLogsInternal();

   public void deleteUnitLogs() {
      deleteUnitLogSoldiers();
      deleteUnitLogsInternal();
   }

   @Query("DELETE FROM NotesNoteTags")
   protected abstract void deleteNoteNoteTags();

   @Query("DELETE FROM NoteTags")
   protected abstract void deleteNoteTags();

   @Query("DELETE FROM Notes")
   protected abstract void deleteNotesInternal();

   public void deleteNotes() {
      deleteNoteNoteTags();
      deleteNoteTags();
      deleteNotesInternal();
   }

   public void setCommanders() {
      long[][] pairs = {
         {1, 1}, {2, 3}, {3, 5},
         {4, 7}, {5, 11}, {6, 15},
         {7, 19}, {8, 23}, {9, 27},
      };
      List<Completable> list = new ArrayList<>(pairs.length);
      for(long[] pair : pairs) {
         list.add(setCommander(pair[0], pair[1]));
      }
      Completable.merge(list).blockingAwait();
   }

   @Query("UPDATE Units SET commanderId=:commanderId WHERE id=:unitId")
   protected abstract Completable setCommander(long unitId, long commanderId);

   @Query("INSERT INTO Units(id, motherUnitId, name) VALUES" +
      "(1, null, 'פלוגה')," +
      "(2, 1, 'מחלקה 1'), (3, 1, 'מחלקה 2')," +
      "(4, 2, 'כיתה 1א'), (5, 2, 'כיתה 1ב'), (6, 2, 'כיתה 1ג')," +
      "(7, 3, 'כיתה 2א'), (8, 3, 'כיתה 2ב'), (9, 3, 'כיתה 2ג')")
   public abstract  void debugUnits();

   @Query("INSERT INTO Soldiers (id, mpId, unitId, name, rank, role) VALUES" +
      "( 1, 1000001, 1, 'אהרון כהן', 'סרן', 'מ\"פ')," +
      "( 2, 1000002, 1, 'רות קליין', 'סגן', 'סמ\"פ')," +
      "( 3, 2000001, 2, 'יצחק כץ', 'סגן', 'מ\"מ 1')," +
      "( 4, 2000002, 2, 'יוסף אדלר', 'סמר', 'סמל מחלקה 1')," +
      "( 5, 2000003, 3, 'יעקב פרידמן', 'סגם', 'מ\"מ 2')," +
      "( 6, 2000004, 3, 'מאיה גולדשטיין', 'סמר', 'סמלת מחלקה 2')," +
      "( 7, 3000001, 4, 'אשר רובין', 'סמל', 'מפקד')," +
      "( 8, 3000002, 4, 'עדינה אברהמי', 'סמל', 'לוחמת')," +
      "( 9, 3000003, 4, 'בנימין לוי', 'רבט', 'לוחם')," +
      "(10, 3000004, 4, 'דניאל פרלמן', 'רבט', 'לוחם')," +
      "(11, 3000005, 5, 'הודיה כהן', 'סמל', 'מפקדת')," +
      "(12, 3000006, 5, 'יואל פרידמן', 'רבט', 'לוחם')," +
      "(13, 3000007, 5, 'תמר ויסמן', 'רבט', 'לוחמת')," +
      "(14, 3000008, 5, 'אהרון לוי', 'רבט', 'לוחם')," +
      "(15, 3000009, 6, 'רייצל בלום', 'סמר', 'מפקדת')," +
      "(16, 3000010, 6, 'דוד הירש', 'סמל', 'לוחם')," +
      "(17, 3000011, 6, 'אסתר כהן', 'סמר', 'לוחמת')," +
      "(18, 3000012, 6, 'יצחק קפלן', 'סמל', 'לוחם')," +
      "(19, 3000013, 7, 'לאה אדלר', 'סמל', 'מפקדת')," +
      "(20, 3000014, 7, 'יעקב רוזנברג', 'סמר', 'לוחם')," +
      "(21, 3000015, 7, 'מרים לוי', 'סמר', 'לוחמת')," +
      "(22, 3000016, 7, 'יונתן גולד', 'סמר', 'לוחם')," +
      "(23, 3000017, 8, 'יוסף שוורץ', 'סמר', 'מפקד')," +
      "(24, 3000018, 8, 'רות רוט', 'סמל', 'לוחמת')," +
      "(25, 3000019, 8, 'שמואל גרין', 'סמר', 'לוחם')," +
      "(26, 3000020, 8, 'חנה פרלמן', 'סמל', 'לוחמת')," +
      "(27, 3000021, 9, 'מיכל שטיינברג', 'סמר', 'מפקדת')," +
      "(28, 3000022, 9, 'שמעון רוטמן', 'רבט', 'לוחם')," +
      "(29, 3000023, 9, 'יואל פרידמן', 'סמל', 'לוחם')," +
      "(30, 3000024, 9, 'נעמי שפירו', 'רבט', 'לוחמת')"
   )
   public abstract void debugSoldiers();

   @Query("INSERT INTO Notes (id, title, soldierId, content, modifyDate, createDate) VALUES" +
      "(01, 'הערות תדרוך', 1, 'סקירה של האסטרטגיה החדשה לפעולה הקרובה. ודא שכל היחידות מקבלות תדרוך בהתאם.', '2024/09/08 15:00', '2024/09/08 15:00')," +
      "(02, 'עדכון פעולה', 1, 'פרטי העדכון לפעולה הלילית. כל המחלקות צריכות להיות מוכנות לשינויים בתוכנית.', '2024/09/07 16:30', '2024/09/07 16:30')," +
      "(03, 'דוח שבועי', 1, 'השלם את הדוח השבועי והגש אותו למחלקת המבצעים עד יום שישי.', '2024/09/08 17:00', '2024/09/08 17:00')," +
      "(04, 'משוב על אימון בשטח', 2, 'אסוף משוב מהתרגיל האחרון בשטח וסכם אותו.', '2024/09/08 18:00', '2024/09/08 18:00')," +
      "(05, 'לוח זמנים לאימון', 2, 'לוח זמנים חדש לאימון הוחל. בדוק את העדכונים האחרונים באתר הפנימי.', '2024/09/08 09:00', '2024/09/08 09:00')," +
      "(06, 'תרגיל צוות', 7, 'וודא שכל חברי הצוות משתתפים בתרגיל המתוכנן למחר בבוקר.', '2024/09/08 10:15', '2024/09/08 10:15')," +
      "(07, 'בדיקת תחזוקה', 8, 'תחזוקה שוטפת לציוד מתוכננת. תאם עם צוות הלוגיסטיקה.', '2024/09/08 12:00', '2024/09/08 12:00')," +
      "(08, 'עדכון לוגיסטי', 8, 'עדכון על תמיכה לוגיסטית לתרגילים הקרובים. בדוק אם ישנם אי דיוקים.', '2024/09/08 11:00', '2024/09/08 11:00')," +
      "(09, 'דוח רפואי', 8, 'עדכון על דוח רפואי לפעולה האחרונה בשטח. ודא שכל הרשומות מדויקות.', '2024/09/07 14:00', '2024/09/07 14:00')," +
      "(10, 'תרגיל שטח', 11, 'התרגיל בשטח נדחה עקב תנאי מזג האוויר. התאם מחדש לשבוע הבא.', '2024/09/08 11:30', '2024/09/08 11:30')," +
      "(11, 'תדרוך צוות', 15, 'תדרוך למנהיגי צוותים לגבי תרגילים קרובים. יש לבצע עד סוף היום.', '2024/09/08 13:45', '2024/09/08 13:45')," +
      "(12, 'תיאום צוות', 15, 'תאם עם מנהיגי צוותים אחרים כדי לייעל את התרגילים המשותפים הקרובים.', '2024/09/08 14:45', '2024/09/08 14:45')," +
      "(13, 'בקשת אספקה', 19, 'בקשה לאספקה נוספת הוגשה. עקוב עם מחלקת האספקה.', '2024/09/08 14:30', '2024/09/08 14:30')," +
      "(14, 'פרוטוקול חירום', 21, 'פרוטוקולי חירום חדשים נכנסים לתוקף. כל היחידות צריכות להתעדכן מיד.', '2024/09/08 15:20', '2024/09/08 15:20')," +
      "(15, 'דוח סיום יום', 23, 'ערוך את דוח סיום היום והגש אותו למרכז הפיקוד.', '2024/09/08 16:00', '2024/09/08 16:00')," +
      "(16, 'בדיקת בטיחות', 27, 'תוצאות בדיקת הבטיחות דרושות. ודא שכל אמצעי הבטיחות מתועדים.', '2024/09/08 09:30', '2024/09/08 09:30')"
   )
   public abstract void debugNotes();

   @Query("INSERT INTO NoteTags(id, name) VALUES" +
      "(1, 'דוח')," +
      "(2, 'רפואי')," +
      "(3, 'אימון')," +
      "(4, 'לוגיסטיקה')," +
      "(5, 'מבצעי')"
   )
   public abstract void debugNoteTags();

   @Query("INSERT INTO NotesNoteTags(id, noteId, noteTagId) VALUES" +
      "(01, 01, 5)," +
      "(02, 02, 5)," +
      "(03, 03, 1)," +
      "(04, 04, 3)," +
      "(05, 04, 5)," +
      "(06, 05, 3)," +
      "(07, 06, 3)," +
      "(08, 07, 4)," +
      "(09, 08, 3)," +
      "(10, 08, 4)," +
      "(11, 09, 1)," +
      "(12, 09, 2)," +
      "(13, 09, 3)," +
      "(14, 10, 3)," +
      "(15, 11, 3)," +
      "(16, 12, 3)," +
      "(17, 13, 4)," +
      "(18, 14, 5)," +
      "(19, 15, 1)"
   )
   public abstract void debugNoteNoteTags();

   @Query("INSERT INTO Disciplinary (soldierId, date, title, description, punishment) VALUES" +
           "(7, '2023/09/01 08:00', 'הפקרת נשק', '', 'שבת')," +
           "(8, '2023/09/02 12:00', 'מכות במרכז פלוגה', '', 'שבת')," +
           "(8, '2023/09/05 23:00', 'היעדרות לא מורשית', 'חייל לא התייצב לשירות במשך 3 ימים', 'משפט')," +
           "(9, '2023/09/08 15:00', 'נפקדות', '', 'חייל מחכה למשפט')," +
           "(10, '2023/09/12 20:00', 'הפקרת עמדה', '', 'שבת')," +
           "(10, '2023/09/15 09:00', 'אי עמידה בזמנים לזמן פלוגתי', '', 'שעתיים ביציאה')"
   )
   public abstract void debugDisciplinaryNotices();

   @Query("INSERT INTO LeaveRequests (soldierId, date, returnDate, reason, status) VALUES" +
           "(7, '2024-09-01', '2024-09-10', 'חופשה משפחתית - במהלך התקופה הזו אני מתכנן לבלות עם משפחתי בארץ, כולל טיולים ופעילויות משותפות. זהו זמן חשוב עבורנו, ואני רוצה להבטיח שאוכל לבלות איתם.', 'מאושר')," +
           "(7, '2024-09-18', '2024-09-22', 'לימודים - אני צריך לצאת להמשך לימודים במוסד חינוכי. זהו שלב חשוב בחיי האקדמיים ואני מתכוון לנצל את הזמן בצורה מיטבית.', 'מחכה לאישורים')," +
           "(9, '2024-09-05', '2024-09-12', 'טיפול רפואי - אני זקוק למספר טיפולים רפואיים חשובים בתקופה זו, ואני רוצה להקדיש את הזמן הנדרש להחלמה והמשך טיפול. זה קריטי לבריאותי.', 'מחכה לאישור רפואי')," +
           "(9, '2024-09-20', '2024-09-25', 'טיסה לחול - אני מתכנן טיסה לחול עם חברים, זו הזדמנות מצוינת להכיר תרבויות חדשות ולחוות חוויות מרגשות.', 'מאושר')," +
           "(12, '2024-09-07', '2024-09-14', 'אירוע אישי - אני מתכנן להשתתף באירוע משפחתי חשוב, כולל חתונה של בן דוד. אני רוצה להקדיש את הזמן לתמוך במשפחתי ולהיות נוכח ברגעים המשמעותיים.', 'לא מאושר')," +
           "(18, '2024-09-10', '2024-09-15', 'חופשה שנתית - אני מתכוון לצאת לחופשה שנתית עם חברים, ולחקור מקומות חדשים. החופשה הזו חשובה לי להתרעננות והפסקה מהשגרה.', 'לא מאושר')," +
           "(19, '2024-09-12', '2024-09-18', 'ביקור משפחתי - אני רוצה לבקר את הסבים שלי שלא ראיתי זמן רב. ביקורם הוא משמעותי עבורי, ואני מתכנן להעביר איתם זמן איכות.', 'מאושר')," +
           "(23, '2024-09-15', '2024-09-20', 'חג - במהלך החג אני מתכוון לבלות עם משפחתי ולקיים מסורת משפחתית חשובה. הזמן הזה חשוב לי מאוד מבחינה רגשית.', 'מאושר')," +
           "(27, '2024-09-22', '2024-09-29', 'חופשה פרטית - אני מתכוון לבלות זמן לבד כדי להירגע ולהתאפס, החופשה הזו חשובה לי מאוד אחרי תקופה עמוסה.', 'לא מאושר')," +
           "(28, '2024-09-25', '2024-09-30', 'סידורים אישיים - אני צריך לנהל מספר סידורים אישיים חשובים במהלך השבועות הקרובים, והזמן הזה הוא קריטי להשלמתם.', 'מאושר')"
   )
   public abstract void debugLeaveRequests();

   @Query("INSERT INTO UnitLogs (id, unitId, title, date) VALUES" +
      "(1, 2, 'דוח 1', '2024/09/19')," +
      "(2, 3, 'דוח 1', '2024/09/19')," +
      "(3, 4, 'רשימת מאזין', '2024/09/15')," +
      "(4, 1, 'נוחכות בשיחת מגד', '2024/08/25')," +
      "(5, 2, 'דוח 1', '2024/09/20')," +
      "(6, 3, 'דוח 1', '2024/09/20')," +
      "(7, 4, 'תדריך בטיחות', '2024/09/13')," +
      "(8, 1, 'עמדת שג', '2024/09/17')"
   )
   public abstract void debugUnitLogs();

   @Query("INSERT INTO UnitLogSoldiers (id, logId, soldierId, value) VALUES" +
      "(01, 1,  3, 'נוכח'), (02, 1,  4, 'נוכח'), (03, 1,  7, 'נוכח')," +
      "(04, 1,  8, 'בבית'), (05, 1,  9, 'נוכח'), (06, 1, 10, 'גימלים')," +
      "(07, 1, 11, 'נוכח'), (08, 1, 12, 'נוכח'), (09, 1, 13, 'נוכח')," +
      "(10, 1, 14, 'בבית'), (11, 1, 15, 'נוכח'), (12, 1, 16, 'נוכח')," +
      "(13, 1, 17, 'נוכח'), (14, 1, 18, 'נוכח'), (15, 2,  5, 'נוכח')," +
      "(16, 2,  6, 'נוכח'), (17, 2, 19, 'בבקשת יציאה'), (18, 2, 20, 'בבית')," +
      "(19, 2, 21, 'בבית'), (20, 2, 22, 'נוכח'), (21, 2, 23, 'נוכח')," +
      "(22, 2, 24, 'נוכח'), (23, 2, 25, 'נוכח'), (24, 2, 26, 'בבית')," +
      "(25, 2, 27, 'נוכח'), (26, 2, 28, 'נוכח'), (27, 2, 29, 'גימלים')," +
      "(28, 2, 30, 'נוכח'), (29, 3,  7, '19:00'), (30, 3,  8, '19:45')," +
      "(31, 3,  9, '20:30'), (32, 3, 10, '21:15'), (33, 4,  7, 'נוכח')," +
      "(34, 4,  8, 'נוכח'), (35, 4,  9, 'לא נוכח'), (36, 4, 10, 'נוכח')," +
      "(37, 5,  3, 'נוכח'), (38, 5,  4, 'בבית'), (39, 5,  7, 'נוכח')," +
      "(40, 5,  8, 'נוכח'), (41, 5,  9, 'נוכח'), (42, 5, 10, 'נוכח')," +
      "(43, 5, 11, 'נוכח'), (44, 5, 12, 'נוכח'), (45, 5, 13, 'גימלים')," +
      "(46, 5, 14, 'נוכח'), (47, 5, 15, 'נוכח'), (48, 5, 16, 'בבית')," +
      "(49, 5, 17, 'נוכח'), (50, 5, 18, 'נוכח'), (51, 6,  5, 'נוכח')," +
      "(52, 6,  6, 'בבית'), (53, 6, 19, 'נוכח'), (54, 6, 20, 'בבית')," +
      "(55, 6, 21, 'בבית'), (56, 6, 22, 'גימלים'), (57, 6, 23, 'נוכח')," +
      "(58, 6, 24, 'נוכח'), (59, 6, 25, 'נוכח'), (60, 6, 26, 'נוכח')," +
      "(61, 6, 27, 'בבקשת יציאה'), (62, 6, 28, 'נוכח'), (63, 6, 29, 'נוכח')," +
      "(64, 6, 30, 'נוכח'), (65, 7,  7, 'נוכח'), (66, 7,  8, 'נוכח')," +
      "(67, 7,  9, 'נוכח'), (68, 7, 10, 'נוכח'), (69, 8,  3, '16:00')," +
      "(70, 8,  4, '16:45'), (71, 8,  7, '17:30'), (72, 8,  8, '18:15')," +
      "(73, 8,  9, '19:00'), (74, 8, 10, '19:45'), (75, 8, 11, '20:00')," +
      "(76, 8, 12, '21:45'), (77, 8, 13, '22:30'), (78, 8, 14, '22:15')," +
      "(79, 8, 15, '23:00'), (80, 8, 16, '00:45'), (81, 8, 17, '01:30')," +
      "(82, 8, 18, '01:15')"
   )
   public abstract void debugUnitLogSoldiers();
}
